Autodesk.Revit.DB.ExtensibleStorage.SchemaBuilder.AcceptableName(System.String)
Checks whether a string is an acceptable name for a Schema or a Field.
Remarks:
For interoperability, names are required to be usable as C++ identifiers.
The allowable characters are ASCII letters, numbers (except the first character) and
underscore. The length must be between 1 and 247 characters.
name:
The string to check.
Returns:
True if the name is acceptable.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.ExtensibleStorage.SchemaBuilder.SetVendorId(System.String)
Sets the ID of the third-party vendor that may access entities of this Schema under the
Vendor acess level, and to generally identify the owner of this Schema.
Remarks:
This method throws an ArgumentException if the given vendor ID string is not valid.
To understand the validity requirements for vendor ID strings, see the documentation
for the ESSchemaBuilder method vendorIdIsValid().
Since vendor IDs are not case sensitive, the string will be converted to upper case
before it is stored in the schema.
vendorId:
The vendor id.
Returns:
The SchemaBuilder object may be used to add more settings.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The vendorId is invalid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The SchemaBuilder has already finished building the Schema.
Since:
2012

Autodesk.Revit.DB.ExtensibleStorage.SchemaBuilder.SetDocumentation(System.String)
Sets the documentation string for the Schema.
Remarks:
While Entities may be hidden using access levels, Schemas and Fields are visible to
clients and other developers. In the interest of clarity and interoperability, you are
very strongly encouraged to provide good documentation with your Schemas.
Explain the intent of the data and how it is meant to be interpreted. It is not
useful to repeat information that can be observed directly (e.g. types and units).
Note that documentation, like all other contents of Schemas and Fields is immutable
once the add-in using the Schema is published.
documentation:
The documentation string.
Returns:
The SchemaBuilder object may be used to add more settings.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The SchemaBuilder has already finished building the Schema.
Since:
2012

Autodesk.Revit.DB.ExtensibleStorage.SchemaBuilder.SetSchemaName(System.String)
Sets the name of the Schema.
Remarks:
The name is a user-friendly identifier of the Schema. GUIDs are used exclusively
for Schema identity, but the name is useful to identify the Schema during development
or in an error message.
This field is required.
schemaName:
The name for the Schema.
Returns:
The SchemaBuilder object may be used to add more settings.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The parameter schemaName is not acceptable for naming Extensible Storage objects.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The SchemaBuilder has already finished building the Schema.
Since:
2012

Autodesk.Revit.DB.ExtensibleStorage.SchemaBuilder.AddMapField(System.String,System.Type,System.Type)
Creates a field containing an ordered key-value map in the Schema, with given name and
type of contained values.
Remarks:
The supported types for the keys are Boolean, Byte, Int16, Int32, Int64, ElementId,
GUID and String. Floating-point types (Float, Double, XYZ and UV) are not supported
because round-off errors frequently cause numeric instability. Subentities are not
supported because they require a custom comparison operator. The suggested workarounds
are either placing key values into an Array and using array indices for keys, or
just using an Array of subentities.
Natural comparison of contained types is used for sorting.
The supported types for values are the same as for simple fields.
See Autodesk.Revit.DB.ExtensibleStorage.SchemaBuilder.AddSimpleField(System.String,System.Type) for details.
Note that a schema may contain a maximum of 256 fields.
fieldName:
The name of the new field.
keyType:
The type of the keys for the new field.
valueType:
The type of the values for the new field.
Returns:
The FieldBuilder object may be used to add more details to the field. Make sure to set
the unit type if the field contains floating-point values.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The parameter fieldName is not acceptable for naming Extensible Storage objects.
-or-
The field type is not supported.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
The combination of key and value types is not supported.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The SchemaBuilder has already finished building the Schema.
Since:
2012

Autodesk.Revit.DB.ExtensibleStorage.SchemaBuilder.AddArrayField(System.String,System.Type)
Creates a field containing an array of values in the Schema, with given name and type
of contained values.
Remarks:
The supported types for the contents are the same as for simple fields.
See Autodesk.Revit.DB.ExtensibleStorage.SchemaBuilder.AddSimpleField(System.String,System.Type) for details.
Note that a schema may contain a maximum of 256 fields.
fieldName:
The name of the new field.
fieldType:
The type of the contents in the new field.
Returns:
The FieldBuilder object may be used to add more details to the field. Make sure to set
the unit type if the field contains floating-point values.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The parameter fieldName is not acceptable for naming Extensible Storage objects.
-or-
The field type is not supported.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The SchemaBuilder has already finished building the Schema.
Since:
2012

Autodesk.Revit.DB.ExtensibleStorage.SchemaBuilder.AddSimpleField(System.String,System.Type)
Creates a field containing a single value in the Schema, with given name and type.
Remarks:
The supported types are Boolean, Byte, Int16, Int32, Int64, Float, Double, ElementId,
GUID, String, XYZ, UV and Entity.
Note that data of type ElementId is not copied to new elements that are created via copy/paste or a linear or radial array.
Note that a schema may contain a maximum of 256 fields.
fieldName:
The name of the new field.
fieldType:
The type of the new field.
Returns:
The FieldBuilder object may be used to add more details to the field. Make sure to set
the unit type if the field contains floating-point values.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The parameter fieldName is not acceptable for naming Extensible Storage objects.
-or-
The field type is not supported.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The SchemaBuilder has already finished building the Schema.
Since:
2012

Autodesk.Revit.DB.ExtensibleStorage.SchemaBuilder.VendorIdIsValid(System.String)
Checks whether the given vendor ID string is valid. A valid vendor ID string:
1. Has a length of at least 4 characters and no more than 253 characters, and
2. Contains only letters, digits, or any of the following special characters:
! " # & \ ( ) + , . - : ; < = > ? _ ` | ~
vendorId:
The vendor ID to check.
Returns:
True if the vendor ID is valid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012